<template>
    <div id="NewsInformation">
        <div class="container">
            <div class="container text-center margin-content">
                <h3>{{ serverList[$route.params.tech_id - 1].title }}</h3>
                <h5>{{ serverList[$route.params.tech_id - 1].date }}</h5>
                <p class='main-content text-left'>{{ serverList[$route.params.tech_id - 1].description }}</p>
            </div>
        </div>
    </div>
</template>
<script>
export default {
  name: "techDetail",
  data() {
    return {
      serverList: [
          {
              logo: require("@/assets/img/pic01.png"),
              title: "向日葵种植技术",
              date: '文章来源：互联网',
              id: 1,
              description: '1、选地整地：向日葵栽培应选择土地平整，肥力中等，灌排方便，土壤粘性相对较小的地块，不宜重茬。以种子方式繁衍后代，播种时以泥炭土为宜。播种前用新高脂膜拌种，能驱避地下害虫，隔离病毒感染，提高种子发芽率。2、适时播种：向日葵的播种时间一般为3～4月，播种的适宜温度为18～25℃，通常播种后5～7天左右出芽。播期选择的基本原则是根据盐碱发生规律，适当早播或晚播，使幼苗避开盐碱为害。根据品种生育期进行春播或夏播。3、查田补苗：向日葵是双子叶作物，顶土出苗较费劲，再加上整地、播种质量不高或播后遇雨表土板结，或病、虫、鼠、雀等为害，都易造成缺苗断垄。为了保证一播全苗，必须在出苗期逐田逐行检查，成片成行缺苗要及时补种。4、间苗定苗：向日葵栽培要及早间苗，防止苗挤苗，影响培育壮苗，乃至以后的产量，至于盐碱地和虫害重的地块，定苗时间可适当推迟。同时，向日葵还要及早定苗，有利于培育壮苗，也有利于花盘发育，定苗应在2对真叶时进行。5、中耕除草：向日葵一般中耕2～3次起除草松土、破除板结、保蓄水分、减少蒸发、减轻盐碱为害等作用，第1次中耕在1～2对真叶时结合间苗定苗进行，第2次中耕在定苗后1周进行，第3次中耕在封垄前结合开沟、培土、施肥完成。6、开沟追肥：向日葵较喜肥，开沟追肥通常在第3次中耕时进行，以氮磷肥为主，每亩磷酸二铵5公斤、尿素10公斤，混合均匀后施入土壤。通过开沟培土能有效的保证次生根生长发育，防止倒伏，减少子叶节以下基部分枝。7、适时灌水：向日葵灌水采用沟灌方式，一般株高1.5米的品种，头水应在花蕾期进行，二水在初花期，三水在灌浆期。株高2米左右的品种，头水在开花前4～5天进行(旱情严重，灌水提前)，二水在头水后6～7天，三水在灌浆期。8、授粉管理：向日葵自花授粉结实率低，异花授粉结实率高，栽培的时候要及时进行人工辅助授粉，用对花盘、粉扑子、棉线手套等方式进行传粉，或收集父本花粉用小刷子轻轻涂抹在母本的柱头上，授粉在盛花期进行3～4次。'
          },
          {
              logo: require("@/assets/img/pic02.png"),
              title: "水稻种植技术",
              date: '文章来源：互联网',
              id: 2,
              description: '本文介绍水稻直播高产栽培技术。 直播稻根系分布浅，群体大，易倒伏，应选择苗期耐寒性好、前期早生快发、分蘖力适中、抗病力强、植株较矮、抗倒力强的早熟或中熟品种。这些产品能从更大程度上提高水稻的产量。给大家提供一部分从实验阶段得到最好的结论的一些产品湘早籼24号、湘早籼32号、湘早籼29号、中98-19、早优143以及超级杂交稻株两优819等。 在种植过程中我们需要很注意土质的情况，整地施肥直播稻对整量要求较高，要做到早翻耕，耕翻时每公顷施腐熟的有机肥11250kg、高效复合肥225kg、碳铵450kg作底肥。田面整平，高低落差不超过3cm，残茬物少。一般每隔3m左右开1条畦沟，作为工作行，以便于施肥、打农等田间管理。开好“三沟”，做到横沟、竖沟、围沟“三沟”相通，沟宽0.2m左右、深0.2～0.3m，使田中排水、流水畅通，田面不积水。等泥浆沉实后，排干水，厢面晾晒1～2d后播种。晒面积种植，采用人工直播的方法既简单又方便。只要做到均匀播种就能获得均衡出苗生长的效果。常规稻直播每公顷大田播种量为45～60kg，用手直播比较容易。但杂交水稻种子每公顷用种量一般为37.5～45kg，用手直播难以做到均匀播种。为了播种均匀，可以将常规稻的稻谷炒熟，使其不能再发芽，然后均匀拌入杂交稻的种子内进行播种。有的地方还采用颗粒肥料代替炒熟的稻谷一起播种，效果也很好。如果种植面积较大，也可以采用水稻直播，调整好播种量后，直接进行播种。播种过程中要防止漏播和重复播种。 面积种植，采用人工直播的方法既简单又方便。只要做到均匀播种就能获得均衡出苗生长的效果。常规稻直播每公顷大田播种量为45～60kg，用手直播比较容易。但杂交水稻种子每公顷用种量一般为37.5～45kg，用手直播难以做到均匀播种。为了播种均匀，可以将常规稻的稻谷炒熟，使其不能再发芽，然后均匀拌入杂交稻的种子内进行播种。有的地方还采用颗粒肥料代替炒熟的稻谷一起播种，效果也很好。如果种植面积较大，也可以采用水稻直播，调整好播种量后，直接进行播种。播种过程中要防止漏播和重复播种。浸种的作用在于使种子吸足水分，发芽整齐，出苗早。将选好的种子先用40℃的温清水浸种12h，然后用300倍石灰水浸种消毒12h，或者用0.3%硫酸铜液浸种48h；消毒后的种子用清水冲洗干净，再用清水浸种2～3d，浸泡过程中注意换水透气，等种子颖壳发白时将其捞出，沥去多余的水分。按这些步骤来，科学的方法给你带来你想要的效果。'
          },
          {
              logo: require("@/assets/img/pic03.png"),
              title: "绿豆种植方法",
              date: '文章来源：互联网',
              id: 3,
              description: '绿豆的播种方法有条播、穴播和撒播，以条播为多。播量要根据品种特性、气候条件和土壤肥力，因地制宜确定。一般下种量要保证在留苗数2倍以上。播量过大，幼苗拥挤，易形成弱苗；播量过小，会造成缺苗断垄。如土质好，墒足，虫少，整地质量好，种小粒型品种，播量要少些；反之，可适当增加播量。鉴于绿豆子叶拱土能力较弱和植株有“稠不抗、稀不长”的群体生育习性，在黏重土壤要适当加大播量。一般条播为每亩1.5-2公斤，撒播为4公斤，间作套种的用种量根据种植情况而定。播深对出苗率影响很大，要根据土壤状况、水分和种子大小及播期等因素而定。在黏土和湿墒地，播深要浅，以3-4厘米为宜；土壤疏松、墒差地，播深以4-5厘米为宜。6-7月份雨水多、气温高，应浅些；春天土壤水分蒸发快，气温较低，可稍深些。以上就是绿豆种植方法的介绍，种植绿豆的朋友可以参考以上方法，结合实际的种植条件，进行合理地种植。'
          }
      ]
    };
  },
  methods: {
  }
};
</script>
<style scoped>
.margin-content {
    margin-top: 140px;
}

.main-content {
  margin-top: 50px;
  font-size: 20px;
}
</style>